### Pandas

In [2]:
import pandas as pd

In [6]:
#dataframe variabel
df =  pd.read_excel(r"/users/munna/Documents/Generative AI/Advance Python/Pandas/data.xlsx")

In [7]:
df

              CountryName CountryCode  ...  InternetUsers          IncomeGroup
0                   Aruba         ABW  ...           78.9          High income
1             Afghanistan         AFG  ...            5.9           Low income
2                  Angola         AGO  ...           19.1  Upper middle income
3                 Albania         ALB  ...           57.2  Upper middle income
4    United Arab Emirates         ARE  ...           88.0          High income
..                    ...         ...  ...            ...                  ...
190           Yemen, Rep.         YEM  ...           20.0  Lower middle income
191          South Africa         ZAF  ...           46.5  Upper middle income
192      Congo, Dem. Rep.         COD  ...            2.2           Low income
193                Zambia         ZMB  ...           15.4  Lower middle income
194              Zimbabwe         ZWE  ...           18.5           Low income

[195 rows x 5 columns]

In [8]:
df.shape

(195, 5)

In [9]:
df.columns

Index(['CountryName', 'CountryCode', 'BirthRate', 'InternetUsers',
       'IncomeGroup'],
      dtype='object')

In [10]:
len(df.columns) #columns

5

In [11]:
len(df) # Rows

195

In [14]:
df.isnull()

     CountryName  CountryCode  BirthRate  InternetUsers  IncomeGroup
0          False        False      False          False        False
1          False        False      False          False        False
2          False        False      False          False        False
3          False        False      False          False        False
4          False        False      False          False        False
..           ...          ...        ...            ...          ...
190        False        False      False          False        False
191        False        False      False          False        False
192        False        False      False          False        False
193        False        False      False          False        False
194        False        False      False          False        False

[195 rows x 5 columns]

In [16]:
df.isna()

     CountryName  CountryCode  BirthRate  InternetUsers  IncomeGroup
0          False        False      False          False        False
1          False        False      False          False        False
2          False        False      False          False        False
3          False        False      False          False        False
4          False        False      False          False        False
..           ...          ...        ...            ...          ...
190        False        False      False          False        False
191        False        False      False          False        False
192        False        False      False          False        False
193        False        False      False          False        False
194        False        False      False          False        False

[195 rows x 5 columns]

In [17]:
df.isnull().sum() # Any missing values

CountryName      0
CountryCode      0
BirthRate        0
InternetUsers    0
IncomeGroup      0
dtype: int64

In [18]:
df.info() # categorical data = object  and numerical data = float64

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   CountryName    195 non-null    object
 1   CountryCode    195 non-null    object
 2   BirthRate      195 non-null    float64
 3   InternetUsers  195 non-null    float64
 4   IncomeGroup    195 non-null    object
dtypes: float64(2), object(3)
memory usage: 7.7+ KB

In [19]:
df[:]

              CountryName CountryCode  ...  InternetUsers          IncomeGroup
0                   Aruba         ABW  ...           78.9          High income
1             Afghanistan         AFG  ...            5.9           Low income
2                  Angola         AGO  ...           19.1  Upper middle income
3                 Albania         ALB  ...           57.2  Upper middle income
4    United Arab Emirates         ARE  ...           88.0          High income
..                    ...         ...  ...            ...                  ...
190           Yemen, Rep.         YEM  ...           20.0  Lower middle income
191          South Africa         ZAF  ...           46.5  Upper middle income
192      Congo, Dem. Rep.         COD  ...            2.2           Low income
193                Zambia         ZMB  ...           15.4  Lower middle income
194              Zimbabwe         ZWE  ...           18.5           Low income

[195 rows x 5 columns]

In [20]:
df[::-1]

              CountryName CountryCode  ...  InternetUsers          IncomeGroup
194              Zimbabwe         ZWE  ...           18.5           Low income
193                Zambia         ZMB  ...           15.4  Lower middle income
192      Congo, Dem. Rep.         COD  ...            2.2           Low income
191          South Africa         ZAF  ...           46.5  Upper middle income
190           Yemen, Rep.         YEM  ...           20.0  Lower middle income
..                    ...         ...  ...            ...                  ...
4    United Arab Emirates         ARE  ...           88.0          High income
3                 Albania         ALB  ...           57.2  Upper middle income
2                  Angola         AGO  ...           19.1  Upper middle income
1             Afghanistan         AFG  ...            5.9           Low income
0                   Aruba         ABW  ...           78.9          High income

[195 rows x 5 columns]

In [21]:
reverse = df[::-1]

In [22]:
df.head() # display top 5 rows

            CountryName CountryCode  ...  InternetUsers          IncomeGroup
0                 Aruba         ABW  ...           78.9          High income
1           Afghanistan         AFG  ...            5.9           Low income
2                Angola         AGO  ...           19.1  Upper middle income
3               Albania         ALB  ...           57.2  Upper middle income
4  United Arab Emirates         ARE  ...           88.0          High income

[5 rows x 5 columns]

In [23]:
df.tail() # bottom 5 rows

          CountryName CountryCode  ...  InternetUsers          IncomeGroup
190       Yemen, Rep.         YEM  ...           20.0  Lower middle income
191      South Africa         ZAF  ...           46.5  Upper middle income
192  Congo, Dem. Rep.         COD  ...            2.2           Low income
193            Zambia         ZMB  ...           15.4  Lower middle income
194          Zimbabwe         ZWE  ...           18.5           Low income

[5 rows x 5 columns]

In [24]:
df[0:200:30] # 30 step record

    CountryName CountryCode  BirthRate  InternetUsers          IncomeGroup
0         Aruba         ABW     10.244          78.90          High income
30       Canada         CAN     10.900          85.80          High income
60        Gabon         GAB     30.555           9.20  Upper middle income
90   Kazakhstan         KAZ     22.730          54.00  Upper middle income
120  Mozambique         MOZ     39.705           5.40           Low income
150       Sudan         SDN     33.477          22.70  Lower middle income
180     Uruguay         URY     14.374          57.69          High income

In [25]:
df[50:101]

               CountryName CountryCode  ...  InternetUsers          IncomeGroup
50                 Ecuador         ECU  ...      40.353684  Upper middle income
51        Egypt, Arab Rep.         EGY  ...      29.400000  Lower middle income
52                 Eritrea         ERI  ...       0.900000           Low income
53                   Spain         ESP  ...      71.635000          High income
54                 Estonia         EST  ...      79.400000          High income
55                Ethiopia         ETH  ...       1.900000           Low income
56                 Finland         FIN  ...      91.514400          High income
57                    Fiji         FJI  ...      37.100000  Upper middle income
58                  France         FRA  ...      81.919800          High income
59   Micronesia, Fed. Sts.         FSM  ...      27.800000  Lower middle income
60                   Gabon         GAB  ...       9.200000  Upper middle income
61          United Kingdom         GBR  ...      89.844100          High income
62                 Georgia         GEO  ...      43.300000  Lower middle income
63                   Ghana         GHA  ...      12.300000  Lower middle income
64                  Guinea         GIN  ...       1.600000           Low income
65             Gambia, The         GMB  ...      14.000000           Low income
66           Guinea-Bissau         GNB  ...       3.100000           Low income
67       Equatorial Guinea         GNQ  ...      16.400000          High income
68                  Greece         GRC  ...      59.866300          High income
69                 Grenada         GRD  ...      35.000000  Upper middle income
70               Greenland         GRL  ...      65.800000          High income
71               Guatemala         GTM  ...      19.700000  Lower middle income
72                    Guam         GUM  ...      65.400000          High income
73                  Guyana         GUY  ...      35.000000  Lower middle income
74    Hong Kong SAR, China         HKG  ...      74.200000          High income
75                Honduras         HND  ...      17.800000  Lower middle income
76                 Croatia         HRV  ...      66.747600          High income
77                   Haiti         HTI  ...      10.600000           Low income
78                 Hungary         HUN  ...      72.643900          High income
79               Indonesia         IDN  ...      14.940000  Lower middle income
80                   India         IND  ...      15.100000  Lower middle income
81                 Ireland         IRL  ...      78.247700          High income
82      Iran, Islamic Rep.         IRN  ...      29.950000  Upper middle income
83                    Iraq         IRQ  ...       9.200000  Upper middle income
84                 Iceland         ISL  ...      96.546800          High income
85                  Israel         ISR  ...      70.800000          High income
86                   Italy         ITA  ...      58.459300          High income
87                 Jamaica         JAM  ...      37.100000  Upper middle income
88                  Jordan         JOR  ...      41.000000  Upper middle income
89                   Japan         JPN  ...      89.710000          High income
90              Kazakhstan         KAZ  ...      54.000000  Upper middle income
91                   Kenya         KEN  ...      39.000000  Lower middle income
92         Kyrgyz Republic         KGZ  ...      23.000000  Lower middle income
93                Cambodia         KHM  ...       6.800000           Low income
94                Kiribati         KIR  ...      11.500000  Lower middle income
95             Korea, Rep.         KOR  ...      84.770000          High income
96                  Kuwait         KWT  ...      75.460000          High income
97                 Lao PDR         LAO  ...      12.500000  Lower middle income
98                 Lebanon         LBN  ...      70.500000  Upper middle income
99                 Liberia         LBR  ...       3.200000           Low income
100                  Libya         LBY  ...      16.500000  Upper middle income

[51 rows x 5 columns]

In [44]:
df[['CountryName', 'CountryCode']]

              CountryName CountryCode
0                   Aruba         ABW
1             Afghanistan         AFG
2                  Angola         AGO
3                 Albania         ALB
4    United Arab Emirates         ARE
..                    ...         ...
190           Yemen, Rep.         YEM
191          South Africa         ZAF
192      Congo, Dem. Rep.         COD
193                Zambia         ZMB
194              Zimbabwe         ZWE

[195 rows x 2 columns]

In [37]:
pd.__version__

'2.2.3'

In [38]:
type(df)

pandas.core.frame.DataFrame